app/controllers/administrator_controller.rb

  def index

  	@search = Order.search(params[:search])
  	@search.order ||= :ascend_by_expected_ship_date
    @orders = @search.paginate(:page => params[:page])
---
SELECT * FROM "orders" WHERE (orders.order_id LIKE '%tatum%') ORDER BY orders.order_id DESC
SELECT * FROM "orders" ORDER BY orders.expected_ship_date ASC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 28)

  def encrypted_cards
  	@orders = Order.all
---
SELECT * FROM "orders"

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM "orders" WHERE ("orders"."id" = 28)
DELETE FROM "orders" WHERE "id" = 28