app/controllers/history_controller.rb

SELECT * FROM "histories" WHERE ((histories.action_type LIKE '%login%') AND (histories.body LIKE '%tatum%')) ORDER BY histories.user_name ASC
SELECT * FROM "histories" WHERE (((histories.remote_ip LIKE '%127.0.0.1%') AND (histories.user_name LIKE '%Tatum Szymczak%')) AND (histories.action_type LIKE '%new_card%')) ORDER BY histories.created_at DESC LIMIT 50
SELECT count(*) AS count_all FROM "histories"
---
	def index

	@search = History.search(params[:search])
	@search.order ||= :ascend_by_created_at

    @history = @search.paginate(:page => params[:page])