app/controllers/orders_controller.rb

  def index

    @search = Order.search(params[:search])
    @search.order ||= :ascend_by_expected_ship_date
    @orders = @search.paginate(:page => params[:page])
---
SELECT * FROM "orders" LIMIT 1
SELECT * FROM "orders" WHERE (orders.processed = 't') ORDER BY orders.expected_ship_date ASC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)

  def create
    @order = Order.new(params[:order])
    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("customer_number", "exp_month", "created_at", "card_type", "exp_year", "updated_at", "last", "credit_card", "processed", "processed_at", "first", "processed_by_name", "first_order_number", "expected_ship_date", "processed_by") VALUES('1234', '01', '2011-01-24 18:54:00', 'visa', '2011', '2011-01-24 18:54:00', 'Szymczak', 'wZdv+4Pqvr9F9WDCWvNj4RdhuVw1EnJEEy0J2thpJbGNKCXNvJJgG6/HEuBo

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 3)

  def update
    @order = Order.find(params[:id])
    #if @order.save
    if @order.update_attributes(params[:order])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 7)
UPDATE "orders" SET "credit_card" = 'Kt1eKgIJ7bOA2BVxGxVOxohNIoikCDy3C+czf/No+Hb25W0utBCXXQGrg97U y7a+B7gLA06woZyRreZuSrICiP1X8KRTevBcIKxSVzM5WTroeTrHRdFhzvzD aaXFHmcBBo7/rTwpoV6tBYcPfqFRyLGxjScs3ZgI91AiStGxDAo=', "updated_at" = '2010-10-05 19:42:55' WHERE "id" = 7

  def process_cc
    @order = Order.find(params[:id])
    @order.processed=true
    @order.processed_by_name = current_user.full_name
    @order.processed_by = current_user
    @order.processed_at = Time.now
    @order.save!
---
SELECT * FROM "orders" WHERE ("orders"."id" = 246)
UPDATE "users" SET "updated_at" = '2011-03-19 15:32:59', "last_request_at" = '2011-03-19 15:32:59' WHERE "id" = 1