app/controllers/users_controller.rb

  def index
  	@users = User.all
---
SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "current_login_ip", "last", "username", "password_salt", "current_login_at", "first", "is_active", "failed_login_count", "is_administrator", "persistence_token", "login_count", "email", "last_login_ip", "created_at") VALUES(NULL, NULL, '2010-10-06 22:12:37', '376a16759ed8453fac99b126a859c56c1c4755925906fe9ef73a713d30714eeef3cdec5cf59cac423e8e0df56f3e18423af4bc7c17fa0ff4bc535e1e4b31d6a7', NULL, 'Szymczak', 'tatum', '3V1E96_ttPbD13bLOiiP', NULL, 'Tatum', NULL, NULL, 't', 'd5ae9c48ef00b6fa598c53e601575e8bfa9195397e8ff18a538ab4fb9afff92ea348a4cf2112bf6f5aaa05f58a48b8f37bda0ee4411942f3a1cc3f17dd430c23', NULL, 'tatum.szymczak@usfood.com', NULL, '2010-10-06 22:12:37')

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "login_count" = 8, "persistence_token" = 'a51c6a73a86874da39afeec3a5eb3deabfaea7aa55f550db7a429a68b646274c4ba7e3aecea9e4af8f76f3b78e03a11c2e17afa5f0dc89eaacbe009542782f63', "updated_at" = '2010-10-07 03:19:01', "username" = 'root', "last" = 'Szymczak', "last_request_at" = '2010-10-07 03:19:01', "last_login_at" = '2010-10-07 03:18:01', "first" = 'Tatum', "current_login_at" = '2010-10-07 03:19:01', "password_salt" = '8O49ZpCEy7DM8FNMOTeW', "crypted_password" = '59a93500def8f6fe5b9700e20095dc9c6e7a2de0436db9ba2b7366e22bf232f90fadd084f1c21cbedb47255786775c51f20071a534e80e948c17cd010ecc88f6' WHERE "id" = 1